## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 3 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                    NAME                     |
|--------|---------------------------------------------|
| add    | `aws_acm_certificate_validation.ai_answers` |
|        | `aws_lb_listener_rule.https_reponses`       |
| delete | `aws_acm_certificate.ai_answers`            |
| update | `aws_lb.ai_answers`                         |
|        | `aws_lb_listener.ai_answers_listener`       |
|        | `aws_lb_target_group.ai_answers`            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_acm_certificate.ai_answers (deposed object c95dd5a8) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_acm_certificate" "ai_answers" {
      - arn                       = "arn:aws:acm:ca-central-1:992382783569:certificate/9b980aa4-5e34-4a39-b9cf-f30cfc2ebbe4" -> null
      - domain_name               = "ai-answers.cdssandbox.xyz" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "*.ai-answers.cdssandbox.xyz"
              - resource_record_name  = "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_1dbd5854332f001e1530bb32d82decb2.zfyfvmchrl.acm-validations.aws."
            },
          - {
              - domain_name           = "ai-answers.cdssandbox.xyz"
              - resource_record_name  = "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_1dbd5854332f001e1530bb32d82decb2.zfyfvmchrl.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:ca-central-1:992382783569:certificate/9b980aa4-5e34-4a39-b9cf-f30cfc2ebbe4" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2026-09-11T23:59:59Z" -> null
      - not_before                = "2025-08-13T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "*.ai-answers.cdssandbox.xyz",
          - "ai-answers.cdssandbox.xyz",
        ] -> null
      - tags                      = {
          - "CostCentre" = "ai-answers-staging"
          - "Terraform"  = "true"
        } -> null
      - tags_all                  = {
          - "CostCentre" = "ai-answers-staging"
          - "Terraform"  = "true"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.ai_answers will be created
  + resource "aws_acm_certificate_validation" "ai_answers" {
      + certificate_arn         = "arn:aws:acm:ca-central-1:992382783569:certificate/8eacc5c5-d9f2-4189-9704-994811011452"
      + id                      = (known after apply)
      + validation_record_fqdns = [
          + "_04becb6cc1a20a59c4da3799216f1762.reponses-ia.cdssandbox.xyz",
          + "_ab895a9c66d5f72b27cf3ee439b88a3c.ai-answers.cdssandbox.xyz",
        ]
    }

  # aws_lb.ai_answers will be updated in-place
  ~ resource "aws_lb" "ai_answers" {
        id                                                           = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:loadbalancer/app/ai-answers-lb/054264388446064f"
        name                                                         = "ai-answers-lb"
      ~ tags                                                         = {
            "CostCentre"   = "ai-answers-staging"
          + "ForceRefresh" = "2025-08-14"
            "Terraform"    = "true"
        }
      ~ tags_all                                                     = {
          + "ForceRefresh" = "2025-08-14"
            # (2 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lb_listener.ai_answers_listener will be updated in-place
  ~ resource "aws_lb_listener" "ai_answers_listener" {
      ~ certificate_arn                                                       = "arn:aws:acm:ca-central-1:992382783569:certificate/9b980aa4-5e34-4a39-b9cf-f30cfc2ebbe4" -> "arn:aws:acm:ca-central-1:992382783569:certificate/8eacc5c5-d9f2-4189-9704-994811011452"
        id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad"
      ~ tags                                                                  = {
            "CostCentre"   = "ai-answers-staging"
          + "ForceRefresh" = "2025-08-14"
            "Terraform"    = "true"
        }
      ~ tags_all                                                              = {
          + "ForceRefresh" = "2025-08-14"
            # (2 unchanged elements hidden)
        }
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lb_listener_rule.https_reponses will be created
  + resource "aws_lb_listener_rule" "https_reponses" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad"
      + priority     = 110
      + tags         = {
          + "CostCentre"   = "ai-answers-staging"
          + "ForceRefresh" = "2025-08-14"
          + "Terraform"    = "true"
        }
      + tags_all     = {
          + "CostCentre"   = "ai-answers-staging"
          + "ForceRefresh" = "2025-08-14"
          + "Terraform"    = "true"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers/2ad377cc9d36fc44"
          + type             = "forward"
        }

      + condition {
          + host_header {
              + values = [
                  + "reponses-ia.cdssandbox.xyz",
                ]
            }
        }
    }

  # aws_lb_target_group.ai_answers will be updated in-place
  ~ resource "aws_lb_target_group" "ai_answers" {
        id                                 = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:targetgroup/ai-answers/2ad377cc9d36fc44"
        name                               = "ai-answers"
      ~ tags                               = {
            "CostCentre"   = "ai-answers-staging"
          + "ForceRefresh" = "2025-08-14"
            "Terraform"    = "true"
        }
      ~ tags_all                           = {
          + "ForceRefresh" = "2025-08-14"
            # (2 unchanged elements hidden)
        }
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ lb_listener                 = {
        id                                                                    = "arn:aws:elasticloadbalancing:ca-central-1:992382783569:listener/app/ai-answers-lb/054264388446064f/9f4e1b4b69a68aad"
      ~ tags                                                                  = {
            CostCentre   = "ai-answers-staging"
          + ForceRefresh = "2025-08-14"
            Terraform    = "true"
        }
      ~ tags_all                                                              = {
          + ForceRefresh = "2025-08-14"
            # (2 unchanged attributes hidden)
        }
        # (30 unchanged attributes hidden)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
